Revit 2027 API
Document.GetElement(Reference) Method
 Gets the Element referenced by the input reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Element GetElement(
	Reference reference
)
Public Function GetElement (
	reference As Reference
) As Element
public:
Element^ GetElement(
	Reference^ reference
)
member GetElement :
        reference : Reference -> Element
Parameters
reference Reference
 The reference, whose referenced Element will be retrieved from the model.
Return Value
Element
 The element referenced by the input argument.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
null will be returned if the input reference doesn't reference to a valid Element.
See Also
Reference
Document Class
GetElement Overload
Autodesk.Revit.DB Namespace